SlimJallouli/stm32h573i_dk_iot_reference/project/stm32h573i_dk_iot_reference.ioc
ProjectManager.LibraryCopy=1
ProjectManager.MainLocation=Core/Src
ProjectManager.NoMain=false
ProjectManager.PreviousToolchain=STM32CubeIDE
ProjectManager.ProjectBuild=false
ProjectManager.ProjectFileName=stm32h573i_dk_iot_reference.ioc
ProjectManager.ProjectName=stm32h573i_dk_iot_reference
ProjectManager.ProjectStructure=
ProjectManager.RegisterCallBack=SPI,UART,USART
ProjectManager.StackSize=0x400
ProjectManager.TargetToolchain=STM32CubeIDE
ProjectManager.ToolChainLocation=
ProjectManager.UAScriptAfterPath=
ProjectManager.UAScriptBeforePath=
ProjectManager.UnderRoot=true
ProjectManager.functionlistsort=1-SystemClock_Config-RCC-false-HAL-false,2-MX_GPIO_Init-GPIO-false-HAL-true,3-MX_GPDMA1_Init-GPDMA1-false-HAL-true,4-MX_ICACHE_Init-ICACHE-false-HAL-true,5-MX_ETH_Init-ETH-false-HAL-true,6-MX_USART1_UART_Init-USART1-false-HAL-true,7-MX_RTC_Init-RTC-false-HAL-true,8-MX_SPI2_Init-SPI2-false-HAL-true,9-MX_TIM5_Init-TIM5-false-HAL-true,10-MX_RNG_Init-RNG-false-HAL-true,11-MX_IWDG_Init-IWDG-false-HAL-true,12-MX_CRC_Init-CRC-false-HAL-true,13-MX_SPI5_Init-SPI5-false-HAL-true,0-MX_CORTEX_M33_NS_Init-CORTEX_M33_NS-false-HAL-true,0-MX_PWR_Init-PWR-false-HAL-true
RCC.ADCFreq_Value=250000000
RCC.AHBFreq_Value=250000000
RCC.APB1Freq_Value=250000000
RCC.APB1TimFreq_Value=250000000
RCC.APB2Freq_Value=250000000
RCC.APB2TimFreq_Value=250000000
RCC.APB3Freq_Value=250000000
RCC.CECFreq_Value=32000
RCC.CKPERFreq_Value=64000000
RCC.CRSFreq_Value=48000000
RCC.CSI_VALUE=4000000
RCC.CortexFreq_Value=250000000
RCC.DACFreq_Value=32768
RCC.EPOD_VALUE=25000000
RCC.ETHFreq_Value=250000000
RCC.FCLKCortexFreq_Value=250000000
RCC.FDCANFreq_Value=25000000
RCC.FamilyName=M
RCC.HCLKFreq_Value=250000000
RCC.HSE_VALUE=25000000
RCC.HSI48_VALUE=48000000
RCC.HSIDiv=RCC_HSI_DIV1
RCC.HSI_VALUE=64000000
RCC.I2C1Freq_Value=250000000
RCC.I2C2Freq_Value=250000000
RCC.I2C3Freq_Value=250000000
RCC.I2C4Freq_Value=250000000
RCC.I3C1Freq_Value=250000000
RCC.IPParameters=ADCFreq_Value,AHBFreq_Value,APB1Freq_Value,APB1TimFreq_Value,APB2Freq_Value,APB2TimFreq_Value,APB3Freq_Value,CECFreq_Value,CKPERFreq_Value,CRSFreq_Value,CSI_VALUE,CortexFreq_Value,DACFreq_Value,EPOD_VALUE,ETHFreq_Value,FCLKCortexFreq_Value,FDCANFreq_Value,FamilyName,HCLKFreq_Value,HSE_VALUE,HSI48_VALUE,HSIDiv,HSI_VALUE,I2C1Freq_Value,I2C2Freq_Value,I2C3Freq_Value,I2C4Freq_Value,I3C1Freq_Value,LPTIM1Freq_Value,LPTIM2Freq_Value,LPTIM3Freq_Value,LPTIM4Freq_Value,LPTIM5Freq_Value,LPTIM6Freq_Value,LPUART1Freq_Value,LSCOPinFreq_Value,LSE_VALUE,LSIRC_VALUE,MCO1PinFreq_Value,MCO2PinFreq_Value,OCTOSPIMFreq_Value,PLL2PoutputFreq_Value,PLL2QoutputFreq_Value,PLL2RoutputFreq_Value,PLL3PoutputFreq_Value,PLL3QoutputFreq_Value,PLL3RoutputFreq_Value,PLLM,PLLN,PLLPoutputFreq_Value,PLLQoutputFreq_Value,PLLSourceVirtual,PWRFreq_Value,RNGFreq_Value,SAI1Freq_Value,SAI2Freq_Value,SDMMC1Freq_Value,SDMMC2Freq_Value,SPI1Freq_Value,SPI2Freq_Value,SPI3Freq_Value,SPI4Freq_Value,SPI5Freq_Value,SPI6Freq_Value,SYSCLKFreq_VALUE,SYSCLKSource,UART12Freq_Value,UART4Freq_Value,UART5Freq_Value,UART7Freq_Value,UART8Freq_Value,UART9Freq_Value,UCPD1outputFreq_Value,USART10Freq_Value,USART11Freq_Value,USART1Freq_Value,USART2Freq_Value,USART3Freq_Value,USART6Freq_Value,USBFreq_Value,VCOInput2Freq_Value,VCOInput3Freq_Value,VCOInputFreq_Value,VCOOutputFreq_Value,VCOPLL2OutputFreq_Value,VCOPLL3OutputFreq_Value
RCC.LPTIM1Freq_Value=250000000
RCC.LPTIM2Freq_Value=250000000
RCC.LPTIM3Freq_Value=250000000
RCC.LPTIM4Freq_Value=250000000
RCC.LPTIM5Freq_Value=250000000
RCC.LPTIM6Freq_Value=250000000
RCC.LPUART1Freq_Value=250000000
RCC.LSCOPinFreq_Value=32000
RCC.LSE_VALUE=32768
RCC.LSIRC_VALUE=32000
RCC.MCO1PinFreq_Value=64000000
RCC.MCO2PinFreq_Value=250000000
RCC.OCTOSPIMFreq_Value=250000000
RCC.PLL2PoutputFreq_Value=258000000
RCC.PLL2QoutputFreq_Value=258000000
RCC.PLL2RoutputFreq_Value=258000000
RCC.PLL3PoutputFreq_Value=258000000
RCC.PLL3QoutputFreq_Value=258000000
RCC.PLL3RoutputFreq_Value=258000000
RCC.PLLM=5
RCC.PLLN=100
RCC.PLLPoutputFreq_Value=250000000
RCC.PLLQoutputFreq_Value=250000000
RCC.PLLSourceVirtual=RCC_PLL1_SOURCE_HSE
RCC.PWRFreq_Value=250000000
RCC.RNGFreq_Value=48000000
RCC.SAI1Freq_Value=258000000
RCC.SAI2Freq_Value=258000000
RCC.SDMMC1Freq_Value=250000000
RCC.SDMMC2Freq_Value=250000000
RCC.SPI1Freq_Value=250000000
RCC.SPI2Freq_Value=250000000
RCC.SPI3Freq_Value=250000000
RCC.SPI4Freq_Value=250000000
RCC.SPI5Freq_Value=250000000
RCC.SPI6Freq_Value=250000000
RCC.SYSCLKFreq_VALUE=250000000
RCC.SYSCLKSource=RCC_SYSCLKSOURCE_PLLCLK
RCC.UART12Freq_Value=250000000
RCC.UART4Freq_Value=250000000
RCC.UART5Freq_Value=250000000
RCC.UART7Freq_Value=250000000
RCC.UART8Freq_Value=250000000
RCC.UART9Freq_Value=250000000
RCC.UCPD1outputFreq_Value=16000000
RCC.USART10Freq_Value=250000000
RCC.USART11Freq_Value=250000000
RCC.USART1Freq_Value=250000000
RCC.USART2Freq_Value=250000000
RCC.USART3Freq_Value=250000000
RCC.USART6Freq_Value=250000000
RCC.USBFreq_Value=48000000
RCC.VCOInput2Freq_Value=4000000
RCC.VCOInput3Freq_Value=4000000
RCC.VCOInputFreq_Value=5000000
RCC.VCOOutputFreq_Value=500000000
RCC.VCOPLL2OutputFreq_Value=516000000
RCC.VCOPLL3OutputFreq_Value=516000000
SH.GPXTI13.0=GPIO_EXTI13
SH.GPXTI13.ConfNb=1
SH.GPXTI3.0=GPIO_EXTI3
SH.GPXTI3.ConfNb=1
SH.GPXTI4.0=GPIO_EXTI4
SH.GPXTI4.ConfNb=1
SH.GPXTI5.0=GPIO_EXTI5
SH.GPXTI5.ConfNb=1
SPI2.BaudRatePrescaler=SPI_BAUDRATEPRESCALER_8
SPI2.CalculateBaudRate=31.25 MBits/s
SPI2.DataSize=SPI_DATASIZE_8BIT
SPI2.Direction=SPI_DIRECTION_2LINES
SPI2.IPParameters=VirtualType,Mode,Direction,CalculateBaudRate,DataSize,BaudRatePrescaler
SPI2.Mode=SPI_MODE_MASTER
SPI2.VirtualType=VM_MASTER
SPI5.BaudRatePrescaler=SPI_BAUDRATEPRESCALER_16
SPI5.CalculateBaudRate=15.625 MBits/s
SPI5.DataSize=SPI_DATASIZE_8BIT
SPI5.Direction=SPI_DIRECTION_2LINES
SPI5.IPParameters=VirtualType,Mode,Direction,CalculateBaudRate,DataSize,BaudRatePrescaler
SPI5.Mode=SPI_MODE_MASTER
SPI5.VirtualType=VM_MASTER
STMicroelectronics.X-CUBE-SAFEA1.1.2.2.BSP.number=1
STMicroelectronics.X-CUBE-SAFEA1.1.2.2.BoardOoExtensionJjSTSAFE_Checked=true
STMicroelectronics.X-CUBE-SAFEA1.1.2.2.BoardOoPartJjSTSAFE_Checked=true
STMicroelectronics.X-CUBE-SAFEA1.1.2.2.IPParameters=STSAFECcBoardOoPartJjSTSAFEA110JjA110,STSAFECcBoardOoExtensionJjSTSAFEA1
STMicroelectronics.X-CUBE-SAFEA1.1.2.2.STSAFECcBoardOoExtensionJjSTSAFEA1=true
STMicroelectronics.X-CUBE-SAFEA1.1.2.2.STSAFECcBoardOoPartJjSTSAFEA110JjA110=true
STMicroelectronics.X-CUBE-SAFEA1.1.2.20.BSP.STBoard=false
STMicroelectronics.X-CUBE-SAFEA1.1.2.20.BSP.api=BSP_BUS_DRIVER
STMicroelectronics.X-CUBE-SAFEA1.1.2.20.BSP.component=
STMicroelectronics.X-CUBE-SAFEA1.1.2.20.BSP.condition=SEMSTSAFECcBoardOoPartJjSTSAFEA110JjA110
STMicroelectronics.X-CUBE-SAFEA1.1.2.20.BSP.instance=I2C1
STMicroelectronics.X-CUBE-SAFEA1.1.2.20.BSP.ip=I2C
STMicroelectronics.X-CUBE-SAFEA1.1.2.20.BSP.mode=I2C
STMicroelectronics.X-CUBE-SAFEA1.1.2.20.BSP.name=STSAFEA1 BUS IO driver
STMicroelectronics.X-CUBE-SAFEA1.1.2.20.BSP.semaphore=
STMicroelectronics.X-CUBE-SAFEA1.1.2.20.BSP.solution=I2C1
STMicroelectronics.X-CUBE-SAFEA1.1.2.2_SwParameter=STSAFECcBoardOoPartJjSTSAFEA110JjA110\:true;STSAFECcBoardOoExtensionJjSTSAFEA1\:true;
STMicroelectronics.X-CUBE-ST67W61.1.0.0.BSP.number=1
STMicroelectronics.X-CUBE-ST67W61.1.0.0.IPParameters=ST67W6XIiNetworkIiDriverCcNetworkJjServiceAPI,ST67W6XIiNetworkIiDriverCcNetworkJjDriverJjW61IiatIiandIibus
STMicroelectronics.X-CUBE-ST67W61.1.0.0.NetworkJjST67W6XIiNetworkIiDriver_Checked=true
STMicroelectronics.X-CUBE-ST67W61.1.0.0.ST67W6XIiNetworkIiDriverCcNetworkJjDriverJjW61IiatIiandIibus=true
STMicroelectronics.X-CUBE-ST67W61.1.0.0.ST67W6XIiNetworkIiDriverCcNetworkJjServiceAPI=true
STMicroelectronics.X-CUBE-ST67W61.1.0.00.BSP.STBoard=false
STMicroelectronics.X-CUBE-ST67W61.1.0.00.BSP.api=Unknown
STMicroelectronics.X-CUBE-ST67W61.1.0.00.BSP.component=
STMicroelectronics.X-CUBE-ST67W61.1.0.00.BSP.condition=
STMicroelectronics.X-CUBE-ST67W61.1.0.00.BSP.instance=SPI2
STMicroelectronics.X-CUBE-ST67W61.1.0.00.BSP.ip=SPI
STMicroelectronics.X-CUBE-ST67W61.1.0.00.BSP.mode=Full-Duplex Master
STMicroelectronics.X-CUBE-ST67W61.1.0.00.BSP.name=NCP_SPI
STMicroelectronics.X-CUBE-ST67W61.1.0.00.BSP.semaphore=
STMicroelectronics.X-CUBE-ST67W61.1.0.00.BSP.solution=SPI2
STMicroelectronics.X-CUBE-ST67W61.1.0.0_SwParameter=ST67W6XIiNetworkIiDriverCcNetworkJjDriverJjW61IiatIiandIibus\:true;ST67W6XIiNetworkIiDriverCcNetworkJjServiceAPI\:true;
USART1.IPParameters=VirtualMode,VirtualMode-Asynchronous
USART1.VirtualMode=VM_ASYNC
USART1.VirtualMode-Asynchronous=VM_ASYNC
VP_ARM.CMSIS-FreeRTOS_VS_RTOSJjFreeRTOS_11.1.0_11.1.0.Mode=RTOSJjFreeRTOS
VP_ARM.CMSIS-FreeRTOS_VS_RTOSJjFreeRTOS_11.1.0_11.1.0.Signal=ARM.CMSIS-FreeRTOS_VS_RTOSJjFreeRTOS_11.1.0_11.1.0
VP_ARM.mbedTLS_VS_PSAJjCrypto_3.1.0_3.1.1.Mode=PSAJjCrypto
VP_ARM.mbedTLS_VS_PSAJjCrypto_3.1.0_3.1.1.Signal=ARM.mbedTLS_VS_PSAJjCrypto_3.1.0_3.1.1
VP_ARM.mbedTLS_VS_SecurityJjmbedOoTLS_3.1.0_3.1.1.Mode=SecurityJjmbedOoTLS
VP_ARM.mbedTLS_VS_SecurityJjmbedOoTLS_3.1.0_3.1.1.Signal=ARM.mbedTLS_VS_SecurityJjmbedOoTLS_3.1.0_3.1.1
VP_AWS.AWS_IoT_Device_Defender_VS_AWSOoIoTJjAWSOoIoTOoDeviceOoDefender_1.3.0_4.1.1.Mode=AWSOoIoTJjAWSOoIoTOoDeviceOoDefender
VP_AWS.AWS_IoT_Device_Defender_VS_AWSOoIoTJjAWSOoIoTOoDeviceOoDefender_1.3.0_4.1.1.Signal=AWS.AWS_IoT_Device_Defender_VS_AWSOoIoTJjAWSOoIoTOoDeviceOoDefender_1.3.0_4.1.1
VP_AWS.AWS_IoT_Device_Shadow_VS_AWSOoIoTJjAWSOoIoTOoDeviceOoShadow_1.3.0_5.0.1.Mode=AWSOoIoTJjAWSOoIoTOoDeviceOoShadow
VP_AWS.AWS_IoT_Device_Shadow_VS_AWSOoIoTJjAWSOoIoTOoDeviceOoShadow_1.3.0_5.0.1.Signal=AWS.AWS_IoT_Device_Shadow_VS_AWSOoIoTJjAWSOoIoTOoDeviceOoShadow_1.3.0_5.0.1
VP_AWS.AWS_IoT_Fleet_Provisioning_VS_AWSOoIoTJjAWSOoIoTOoFleetOoProvisioning_1.2.1_1.1.0.Mode=AWSOoIoTJjAWSOoIoTOoFleetOoProvisioning
VP_AWS.AWS_IoT_Fleet_Provisioning_VS_AWSOoIoTJjAWSOoIoTOoFleetOoProvisioning_1.2.1_1.1.0.Signal=AWS.AWS_IoT_Fleet_Provisioning_VS_AWSOoIoTJjAWSOoIoTOoFleetOoProvisioning_1.2.1_1.1.0
VP_AWS.AWS_IoT_Over-the-air_Update_VS_AWSOoIoTJjAWSOoIoTOoOverAatheAaairOoUpdate_3.4.0_5.0.1.Mode=AWSOoIoTJjAWSOoIoTOoOverAatheAaairOoUpdate
VP_AWS.AWS_IoT_Over-the-air_Update_VS_AWSOoIoTJjAWSOoIoTOoOverAatheAaairOoUpdate_3.4.0_5.0.1.Signal=AWS.AWS_IoT_Over-the-air_Update_VS_AWSOoIoTJjAWSOoIoTOoOverAatheAaairOoUpdate_3.4.0_5.0.1
VP_AWS.backoffAlgorithm_VS_FreeRTOSJjbackoffAlgorithm_1.3.0_4.1.1.Mode=FreeRTOSJjbackoffAlgorithm
VP_AWS.backoffAlgorithm_VS_FreeRTOSJjbackoffAlgorithm_1.3.0_4.1.1.Signal=AWS.backoffAlgorithm_VS_FreeRTOSJjbackoffAlgorithm_1.3.0_4.1.1
VP_AWS.coreJSON_VS_FreeRTOSJjcoreJSON_3.2.0_4.1.1.Mode=FreeRTOSJjcoreJSON
VP_AWS.coreJSON_VS_FreeRTOSJjcoreJSON_3.2.0_4.1.1.Signal=AWS.coreJSON_VS_FreeRTOSJjcoreJSON_3.2.0_4.1.1
VP_AWS.coreMQTT_Agent_VS_FreeRTOSJjcoreMQTTOoAgent_1.2.0_5.0.1.Mode=FreeRTOSJjcoreMQTTOoAgent
VP_AWS.coreMQTT_Agent_VS_FreeRTOSJjcoreMQTTOoAgent_1.2.0_5.0.1.Signal=AWS.coreMQTT_Agent_VS_FreeRTOSJjcoreMQTTOoAgent_1.2.0_5.0.1
VP_AWS.coreMQTT_VS_FreeRTOSJjcoreMQTT_2.1.1_5.0.1.Mode=FreeRTOSJjcoreMQTT
VP_AWS.coreMQTT_VS_FreeRTOSJjcoreMQTT_2.1.1_5.0.1.Signal=AWS.coreMQTT_VS_FreeRTOSJjcoreMQTT_2.1.1_5.0.1
VP_BOOTPATH_VS_BOOTPATH.Mode=BP_Activate
VP_BOOTPATH_VS_BOOTPATH.Signal=BOOTPATH_VS_BOOTPATH
VP_CORTEX_M33_NS_VS_Hclk.Mode=Hclk_Mode
VP_CORTEX_M33_NS_VS_Hclk.Signal=CORTEX_M33_NS_VS_Hclk
VP_CRC_VS_CRC.Mode=CRC_Activate
VP_CRC_VS_CRC.Signal=CRC_VS_CRC
VP_GPDMA1_VS_GPDMACH0.Mode=SIMPLEREQUEST_GPDMACH0
VP_GPDMA1_VS_GPDMACH0.Signal=GPDMA1_VS_GPDMACH0
VP_GPDMA1_VS_GPDMACH1.Mode=SIMPLEREQUEST_GPDMACH1
VP_GPDMA1_VS_GPDMACH1.Signal=GPDMA1_VS_GPDMACH1
VP_GPDMA1_VS_GPDMACH4.Mode=SIMPLEREQUEST_GPDMACH4
VP_GPDMA1_VS_GPDMACH4.Signal=GPDMA1_VS_GPDMACH4
VP_GPDMA1_VS_GPDMACH5.Mode=SIMPLEREQUEST_GPDMACH5
VP_GPDMA1_VS_GPDMACH5.Signal=GPDMA1_VS_GPDMACH5
VP_ICACHE_VS_ICACHE.Mode=DefaultMode
VP_ICACHE_VS_ICACHE.Signal=ICACHE_VS_ICACHE
VP_IWDG_VS_IWDG.Mode=IWDG_Activate
VP_IWDG_VS_IWDG.Signal=IWDG_VS_IWDG
VP_MEMORYMAP_VS_MEMORYMAP.Mode=CurAppReg
VP_MEMORYMAP_VS_MEMORYMAP.Signal=MEMORYMAP_VS_MEMORYMAP
VP_PWR_VS_DBSignals.Mode=DisableDeadBatterySignals
VP_PWR_VS_DBSignals.Signal=PWR_VS_DBSignals
VP_PWR_VS_LPOM.Mode=PowerOptimisation
VP_PWR_VS_LPOM.Signal=PWR_VS_LPOM
VP_PWR_VS_SECSignals.Mode=Security/Privilege
VP_PWR_VS_SECSignals.Signal=PWR_VS_SECSignals
VP_RNG_VS_RNG.Mode=RNG_Activate
VP_RNG_VS_RNG.Signal=RNG_VS_RNG
VP_RTC_VS_RTC_Activate.Mode=RTC_Enabled
VP_RTC_VS_RTC_Activate.Signal=RTC_VS_RTC_Activate
VP_RTC_VS_RTC_Calendar.Mode=RTC_Calendar
VP_RTC_VS_RTC_Calendar.Signal=RTC_VS_RTC_Calendar
VP_STMicroelectronics.X-CUBE-SAFEA1_VS_BoardOoExtensionJjSTSAFE_1.2.2_1.2.2.Mode=BoardOoExtensionJjSTSAFE
VP_STMicroelectronics.X-CUBE-SAFEA1_VS_BoardOoExtensionJjSTSAFE_1.2.2_1.2.2.Signal=STMicroelectronics.X-CUBE-SAFEA1_VS_BoardOoExtensionJjSTSAFE_1.2.2_1.2.2
VP_STMicroelectronics.X-CUBE-SAFEA1_VS_BoardOoPartJjSTSAFE_1.2.2_1.2.2.Mode=BoardOoPartJjSTSAFE
VP_STMicroelectronics.X-CUBE-SAFEA1_VS_BoardOoPartJjSTSAFE_1.2.2_1.2.2.Signal=STMicroelectronics.X-CUBE-SAFEA1_VS_BoardOoPartJjSTSAFE_1.2.2_1.2.2
VP_STMicroelectronics.X-CUBE-ST67W61_VS_NetworkJjST67W6XIiNetworkIiDriver_1.0.0_1.0.0.Mode=NetworkJjST67W6XIiNetworkIiDriver
VP_STMicroelectronics.X-CUBE-ST67W61_VS_NetworkJjST67W6XIiNetworkIiDriver_1.0.0_1.0.0.Signal=STMicroelectronics.X-CUBE-ST67W61_VS_NetworkJjST67W6XIiNetworkIiDriver_1.0.0_1.0.0
VP_SYS_VS_Systick.Mode=SysTick
VP_SYS_VS_Systick.Signal=SYS_VS_Systick
VP_TIM5_VS_ClockSourceINT.Mode=Internal
VP_TIM5_VS_ClockSourceINT.Signal=TIM5_VS_ClockSourceINT
VP_lwIP.lwIP_VS_NetworkJjlwIP_2.3.0_2.3.0.Mode=NetworkJjlwIP
VP_lwIP.lwIP_VS_NetworkJjlwIP_2.3.0_2.3.0.Signal=lwIP.lwIP_VS_NetworkJjlwIP_2.3.0_2.3.0
board=custom
lwIP.lwIP.2.3.0.IPParameters=lwIPCcNetworkJjInterfaceJjEthernet,lwIPCcNetworkJjAPI,lwIPCcNetworkJjCORE,lwIPCcNetworkJjRTOS
lwIP.lwIP.2.3.0.NetworkJjlwIP_Checked=true
lwIP.lwIP.2.3.0.lwIPCcNetworkJjAPI=true
lwIP.lwIP.2.3.0.lwIPCcNetworkJjCORE=IPv4
lwIP.lwIP.2.3.0.lwIPCcNetworkJjInterfaceJjEthernet=true
lwIP.lwIP.2.3.0.lwIPCcNetworkJjRTOS=FreeRTOS
lwIP.lwIP.2.3.0_SwParameter=lwIPCcNetworkJjCORE\:IPv4;lwIPCcNetworkJjInterfaceJjEthernet\:true;lwIPCcNetworkJjAPI\:true;lwIPCcNetworkJjRTOS\:FreeRTOS;
